# План тестирования
---

# Содержание
1 [Введение](#introduction)  
2 [Объект тестирования](#items)  
3 [Атрибуты качества](#quality)  
4 [Риски](#risk)  
5 [Аспекты тестирования](#features)  
6 [Подходы к тестированию](#approach)  
7 [Представление результатов](#pass)  
8 [Выводы](#conclusion)

<a name="introduction"/>

## Введение

Данный документ описывает план тестирования приложения ["EnjoyPlayer"](https://github.com/glestorn/EnjoyPlayer). Документ предназначен для людей, выполняющих тестирование данного проекта. Цель тестирования - проверка соответствия реального поведения программы проекта и ее ожидаемого поведения, которое описано в [требованиях](https://github.com/glestorn/EnjoyPlayer/blob/master/Documents/Requirements/RussianRequirementsDocument.md).

<a name="items"/>

## Объект тестирования

В качестве объектов тестирования можно выделить следующие функциональные требования:

* Воспроизведение аудиоконтента;
* Создание плейлистов;
* Управление ранее созданными плейлистами;
* Функция перемешивания композиций из списка;
* Функция повторного воспроизведения плейлиста. 

<a name="quality"/>

## Атрибуты качества

1. Функциональность:
    - функциональная полнота: приложение должно выполнять все заявленные [функции](https://github.com/AnjeyNov/TRTPO-Project/blob/master/Documents/Requirements/Software%20Requirements%20Specification.md#31-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B5-%D1%82%D1%80%D0%B5%D0%B1%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F);
    - функциональная корректность: приложение должно выполнять все заявленные функции корректно;
2. Удобство использования:
    - независание музыки во время исполнения;
    - интуитивно понятный и простой интерфейс;
    - автоматическая подстройка программы под различные форматы аудиоконтента;
    - удобное управление множеством плейлистов.
3. Безопасность:  
    - храниние плейлистов в папке программы, изолируя данную информацию от файлов системы.

<a name="risk"/>

## Риски

В данном случае к рискам можно отнести:
* изменение iis.bsuir.by своего api;
* обрыв интернет-соединения при выполниении теста в котором оно предусмотрено;
* при запуске приложения в среде версии меньше указанной в [требованиях](https://github.com/AnjeyNov/TRTPO-Project/blob/master/Documents/Requirements/Software%20Requirements%20Specification.md#322-%D0%BE%D0%B3%D1%80%D0%B0%D0%BD%D0%B8%D1%87%D0%B5%D0%BD%D0%B8%D1%8F) приложение может работать некорректно.

<a name="features"/>

## Аспекты тестирования

В ходе тестирования планируется проверить реализацию основных функций приложения. Аспекты, подвергаемые тестированию: 
* запуск приложения;

* Остановка/продолжение воспроизведения композиции  
* Переход к предыдущему/следующему треку в списке  
* Переход к любому времени композиции 
* Изменение громкости воспроизведения аудиоконтента  
* Создание/удаление плейлиста  
* Включение/отключение перемешивания треков  
* Включение/отключение повторного воспроизведения плейлиста  

### Запуск приложения
Этот вариант использования небходимо протестировать на:
* запуск приложения;
* отображение окна иложения согласно [мокапу](https://github.com/AnjeyNov/TRTPO-Project/blob/master/Documents/Requirements/Software%20Requirements%20Specification.md#22-%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D1%84%D0%B5%D0%B9%D1%81-%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8F).

### Остановка/продолжение воспроизведения композиции
Этот вариант использования небходимо протестировать на:
* остановку воспроизведения композиции;  
* продолжение воспроизведения композиции.  

### Переход к предыдущему/следующему треку в списке
Этот вариант использования небходимо протестировать на:
* переход к предыдущему треку в списке;  
* переход к предыдущему треку, если он первый в списке;  
* переход к следующему треку в списке;  
* переход к следующему треку, если он последний в списке.  

### Переход к любому времени композиции
Этот вариант использования небходимо протестировать на:
* переход к любому времени композиции;

### Изменение громкости воспроизведения аудиоконтента
Этот вариант использования небходимо протестировать на:
* изменение громкости воспроизведения аудиоконтента.

### Создание/удаление плейлиста
Этот вариант использования небходимо протестировать на:
* создание плейлиста;
* удаление плейлиста.

### Включение/отключение перемешивания треков
Этот вариант использования небходимо протестировать на:
* включение перемешивания треков;
* отключение перемешивания треков.

### Включение/отключение повторного воспроизведения плейлиста
Этот вариант использования небходимо протестировать на:
* включениеповторного воспроизведения плейлиста;
* отключение повторного воспроизведения плейлиста.

## Нефункциональные требования:
* работа без срывов даже с тяжелыми форматами музыки;
* интуитивно понятный и простой интерфейс;
* храниние плейлистов в папке программы, изолируя данную информацию от файлов системы.

<a name="approach"/>

## Подходы к тестированию

При тестировании будет использован ручной подход.

<a name="pass"/>

## Представление результатов

Результаты представлены  в документе ["Результаты тестирования"](https://github.com/s1ovak/PhoneShop/blob/master/Testing/TestResults.md).

<a name="conclusion"/>

## Выводы

Данный тестовый план позволяет протестировать основной функционал приложения. Успешное прохождение всех тестов не гарантирует полной работоспособности на всех версиях платформ и архитектурах, однако позволяет полагать, что данное программное обеспечение работает корректно. На момент прохождения тестирования с результатами в пункте 7, приложение работало некорректно из-за невыполнения задач в поставленные сроки. Данное тестирование должно быть проведено повторно согласно плану после окончания разработки проекта.
